Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་བཤེས་གཉེན་དང་མ་བྲལ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities will never separate from their spiritual teachers.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་མཐོང་བ་དང་། ཐོས་པ་དང་། དྲན་པ་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: What are those ten? They should never stop seeing, hearing, or remembering the buddhas;

source: ཆོས་མཉན་པ་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: never stop listening to the Dharma;

source: དགེ་འདུན་མཆོད་ཅིང་བསྙེན་བཀུར་བ་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: never stop worshiping and venerating the saṅgha;

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གུས་པར་སྨྲ་བ་དང་། ཕྱག་འཚལ་བ་དང་། ལྡང་བ་དང་། ཐལ་མོ་སྦྱར་བ་དང་། གདུད་པའི་ལས་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: never stop speaking respectfully of the buddhas and bodhisattvas, prostrating to them, standing up for them, joining their palms toward them, and performing acts of reverence;

source: མང་དུ་ཐོས་པའི་གང་ཟག་ཆོས་སྨྲ་བ་རྣམས་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: never separate from Dharma teachers of vast learning;

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་མཉན་པ་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: never stop receiving the teachings on the perfections;

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་མཉན་པ་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: never stop receiving the teachings on the factors of awakening;

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་མཉན་པ་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: never stop listening to teachings on the three gateways to liberation;

source: ཚངས་པའི་གནས་བཞི་མཉན་པ་དང་མ་བྲལ་བ་རྣམས་ཡིན།
en: never stop listening to the teachings on the four abodes of Brahmā;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་མཉན་པ་དང་མ་བྲལ་བ་རྣམས་ཡིན་ཏེ།
en: never stop listening to the teachings on omniscience.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་བཤེས་གཉེན་དང་མ་བྲལ་བ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities never separate from their spiritual teachers.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤངས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities give up unwholesome company.

source: ཚུལ་ཁྲིམས་ཉམས་པའི་གང་ཟག་རྣམ་པར་སྤངས་པས་སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤངས་པར་རིག་པར་བྱའོ།
en: They understand that giving up unwholesome company involves giving up the company of people whose discipline has degenerated.

source: ལྟ་བ་ཉམས་པའི་གང་ཟག་རྣམ་པར་སྤངས་པ་དང་། ཆོ་ག་ཉམས་པའི་གང་ཟག་རྣམ་པར་སྤངས་པ་དང་། འཚོ་བ་ཉམས་པའི་གང་ཟག་རྣམ་པར་སྤངས་པ་དང་།
en: Likewise, it involves giving up the company of those whose view has degenerated, whose conduct has degenerated, and whose livelihood has degenerated.

source: འདུ་འཛི་ལ་དགའ་བའི་གང་ཟག་རྣམ་པར་སྤངས་པ་དང་། ལེ་ལོ་ཅན་གྱི་གང་ཟག་རྣམ་པར་སྤངས་པ་དང་། འཁོར་བ་ལ་དགའ་བའི་གང་ཟག་རྣམ་པར་སྤངས་པ་དང་། བྱང་ཆུབ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པའི་གང་ཟག་རྣམ་པར་སྤངས་པ་དང་། ཁྱིམ་པ་དང་སྟེན་པ་རྣམ་པར་སྤངས་པ་དང་།
en: Further, it involves giving up the company of those who are fond of social activities, the lazy, those who are fond of cyclic existence, and those who turn their back on awakening, as well as avoiding association with householders.

source: ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་སྤངས་པས་ན་སྡིག་པའི་གྲོགས་པོ་རྣམ་པར་སྤངས་པར་རིག་པར་བྱ་སྟེ།
en: Finally, giving up unwholesome company involves relinquishing all the afflictions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེས་གནས་འདི་དག་རྣམ་པར་སྤོང་བའི་ཚེ། གང་ཟག་དེ་དག་ལ་ཞེ་སྡང་བའི་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: Noble son, when bodhisattvas give up all such associations, they must not become hostile to any of these people.

source: ཁོང་ཁྲོ་བའི་སེམས་དང་། བརྙས་པའི་སེམས་བསྐྱེད་པར་མི་བྱའི།
en: They should avoid any aggression or disdain.

source: དེས་འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་སེམས་ཅན་རྣམས་ནི་ཁམས་སོ་སོར་བསྟེན་ཏེ། བསྟེན་པར་གྱུར་ནས་ཆུད་ཟ་བར་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་གྱིས།
en: Instead, they should recollect what the Blessed One has taught—‘Sentient beings influence one another; through their company, they are destroyed’

source: དེ་བས་ན་བདག་གིས་བསྟེན་པ་ཡོངས་སུ་སྤང་བར་སེམས་ཉེ་བར་གཞག་པར་བྱའོ།
en: —and they should think, ‘Thus, I too will develop the determination to give up all such associations.’

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤངས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities give up unwholesome company.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཆོས་ཉིད་ཐོབ་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities attain the intrinsic nature of the thus-gone ones’ body.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་མཉམ་པ་རྣམས་ཡིན། ལུས་ཡོངས་སུ་དག་པ་རྣམས་ཡིན། ལུས་རྨ་མེད་པ་རྣམས་ཡིན། ལུས་ལེགས་པར་གྲུབ་པ་རྣམས་ཡིན། ཆོས་ཀྱི་ལུས་རྣམས་ཡིན། ལུས་བརྟག་པར་བྱ་བ་མ་ཡིན་ཞིང་གཏིང་དཔག་དཀའ་བ་རྣམས་ཡིན། ལུས་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམས་ཡིན། ལུས་ཞི་བ་རྣམས་ཡིན། ལུས་ནམ་མཁའ་དང་མཚུངས་པ་རྣམས་ཡིན། ཡེ་ཤེས་ཀྱི་ལུས་དང་ལྡན་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are a body of sameness, a body of purity, a body free of wounds, a body of excellent accomplishment, a body of Dharma, a body beyond analysis that is hard to fathom, an inconceivable body, a body of peace, a body that is equal to space, and a body of wisdom.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཆོས་ཉིད་འཐོབ་པར་འགྱུར་རོ།
en: Noble son, bodhisattvas who possess these ten qualities attain the intrinsic nature of the thus-gone ones’ body.”

source: བཅོམ་ལྡན་འདས་གང་དང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཆོས་ཉིད་འཐོབ་པར་འགྱུར།
en: “Blessed One, at which times do bodhisattvas attain the intrinsic nature of the thus-gone ones’ body in this manner?”

source: ས་དང་པོ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་མཉམ་པ་ཉིད་ཐོབ་བོ།
en: “on the first ground, bodhisattvas attain the body of sameness.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལུས་མི་མཉམ་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་དུ་འགྱུར་བའི་ཕྱིར་རོ།
en: Why is that? Because, free from all forms of unevenness, the body is at that point equal to the bodies of all bodhisattvas.

source: ས་གཉིས་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་ཕྱིར་ལུས་ཡོངས་སུ་དག་པ་འཐོབ་བོ།
en: On the second ground, they attain the body of purity due to their pure discipline.

source: ས་གསུམ་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཁོང་ཁྲོ་བ་དང་། གནོད་སེམས་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་ལུས་རྨ་མེད་པ་འཐོབ་བོ།
en: On the third ground, their minds are free of anger and ill will. Hence, they attain the body that is free of wounds.

source: ས་བཞི་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་གྲུབ་པའི་ཕྱིར་ལུས་ལེགས་པར་གྲུབ་པ་འཐོབ་བོ།
en: On the fourth ground, bodhisattvas accomplish the qualities of the Buddha. Thus they attain the body of excellent accomplishment.

source: ས་ལྔ་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་རབ་ཏུ་རྟོགས་པའི་ཕྱིར་ཆོས་ཀྱི་ལུས་འཐོབ་བོ།
en: On the fifth ground, bodhisattvas achieve excellent realization of all the Dharma, thereby attaining the body of Dharma.

source: ས་དྲུག་པ་ལ་བརྟག་པར་བྱ་བ་མ་ཡིན་ཞིང་གཏིང་དཔག་དཀའ་བའི་ཆོས་ཡོངས་སུ་གྲུབ་པའི་ཕྱིར་ལུས་བརྟག་པར་བྱ་བ་མ་ཡིན་ཞིང་གཏིང་དཔག་དཀའ་བ་འཐོབ་བོ།
en: On the sixth ground, they accomplish the Dharma that is beyond analysis and hard to fathom. Hence they attain the body beyond analysis that is hard to fathom.

source: ས་བདུན་པ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་གྲུབ་པ་དང་། ཐབས་མཁས་པ་ཡང་དག་པར་གྲུབ་པའི་ཕྱིར་ལུས་བསམ་གྱིས་མི་ཁྱབ་པ་འཐོབ་བོ།
en: On the seventh ground, bodhisattvas accomplish the qualities of the buddhas and the true mastery of skillful means. Thereby they attain the inconceivable body.

source: ས་བརྒྱད་པ་ལ་སྤྲོས་པ་ཐམས་ཅད་བྲལ་བ་དང་། ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་ལུས་ཞི་བ་འཐོབ་བོ།
en: On the eighth ground, bodhisattvas are free from all constructs and afflictions, thereby attaining the body of peace.

source: ས་དགུ་པ་ལ་ལུས་ཚད་མེད་པས་ཁྱབ་པའི་ཕྱིར་ལུས་ནམ་མཁའ་དང་མཚུངས་པ་འཐོབ་བོ།
en: On the ninth ground, their bodies pervade infinitely, and so they attain the body that is equal to space.

source: ས་བཅུ་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཀྱི་ལུས་འཐོབ་བོ།
en: On the tenth ground, bodhisattvas attain the body of wisdom.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་པར་བྱ་བ་ཐམས་ཅད་ཡང་དག་པར་གྲུབ་པའི་ཕྱིར་རོ།
en: Why is that the case? Because they accomplish all that is to be known.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཆོས་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་ཆོས་ཉིད་ལ་ཐ་དད་དུ་བགྱི་བ་མཆིས་སམ།
en: “Blessed One, is there no difference between the intrinsic nature of a thus-gone one’s body and that of a bodhisattva?” inquired the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལུས་ཐ་དད་པས་ཐ་དད་དུ་བྱ་བ་མེད་དེ། ཡོན་ཏན་གྱི་མཐུས་ནི་ཐ་དད་དུ་བྱ་བ་ཡོད་དོ།
en: “Noble son,” replied the Blessed One, “there are no differences between their bodies as such, yet the body of a bodhisattva and the body of a thus-gone one still differ in terms of the power of their qualities.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ལུས་ཐ་དད་པས་ཐ་དད་དུ་བགྱི་བ་མ་མཆིས་ལ། ཡོན་ཏན་གྱི་མཐུས་ཐ་དད་དུ་བགྱི་བ་མཆིས་པ་གང་ལགས།
en: “Blessed One, in what sense is there no difference between their bodies as such, yet the power of their qualities are different?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལུས་ལུས་ཞེས་བྱ་བ་འདི་ནི་ཐ་དད་པ་མེད་པ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལུས་སུ་བརྗོད་པའི་མཚན་ཉིད་གཅིག་པའི་ཕྱིར་རོ།
en: “Noble son,” replied the Blessed One, “there are no differences with respect to that which we refer to as their body , because the two fulfill in the same way the characteristics of a body.

source: ཡོན་ཏན་དང་མཐུའི་མཚན་ཉིད་ནི་ཐ་དད་པར་བལྟའོ།
en: However, the characteristics of their powers and qualities should be considered to be different.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་གང་ལྟ་བུར་ཡོན་ཏན་གྱི་མཐུའི་མཚན་ཉིད་ཐ་དད་དུ་བལྟ་བར་བགྱི།
en: “Blessed One, in what way should the characteristics of their powers and qualities be considered different?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་བས་ན་དོན་གྱི་དབང་འདི་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལ་དཔེར་བྱའོ།
en: “Noble son,” replied the Blessed One, “let me provide an analogy, so that you may understand this point.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་བྱི་དོར་མ་བྱས་པའི་ནོར་བུ་རིན་པོ་ཆེ་དང་། བྱི་དོར་བྱས་པའི་ནོར་བུ་རིན་པོ་ཆེ་ནི་འདི་ལྟ་སྟེ། ནོར་བུ་རིན་པོ་ཆེ་ནོར་བུ་རིན་པོ་ཆེ་ཞེས་བྱ་བར་ནོར་བུ་རིན་པོ་ཆེ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་
en: Noble son, think of a jewel that has not been polished and another jewel that has—both are jewels and both are categorized as jewels.

source: མོད་ཀྱི། ཇི་ལྟར་བྱི་དོར་བྱས་པའི་ནོར་བུ་རིན་པོ་ཆེའི་མཐུ་དང་། ཡིད་དུ་འོང་བས་ཁྱབ་པར་བྱེད་པ་དེ་ལྟར་ནི་བྱི་དོར་མ་བྱས་པས་མ་ཡིན་ནོ།
en: Nevertheless, the pervasive power and beauty of the polished jewel is absent in the unpolished jewel.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ནོར་བུ་རིན་པོ་ཆེ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ནོར་བུ་རིན་པོ་ཆེ་དང་བཅས་སུ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཆོས་ཉིད་ཀྱི་གྲངས་སུ་འགྲོ་
en: Similarly, the jewel of a bodhisattva’s body is described as having the intrinsic nature of a thus-gone one’s body, just as the jewel of a thus-gone one’s body is.

source: མོད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ནོར་བུ་རིན་པོ་ཆེ་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ནོར་བུ་རིན་པོ་ཆེའི་དྲུང་དུ་ཡོངས་སུ་དག་པ་ཞེས་མི་བརྗོད་དོ།
en: Nevertheless, compared to the jewel of a thus-gone one’s body the jewel of a bodhisattva’s body is not pure.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པའི་སྐུའི་ནོར་བུ་རིན་པོ་ཆེ་ནི་སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་དང་། ནམ་མཁའི་དབྱིངས་ཚད་མེད་པའི་འོད་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ་གནས་སོ།
en: Why? Because the light of the jewel of a thus-gone one’s body pervades all the infinite realms of sentient beings and throughout the boundless expanse of space.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་དང་། དྲི་མ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་ཏེ།
en: And why? Because it is completely pure and free of any stain.

source: བྱང་ཆུབ་སེམས་དཔའི་ལུས་ནོར་བུ་རིན་པོ་ཆེ་ནི་དེ་ཙམ་དུ་ཁྱབ་པར་བྱེད་པ་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དྲི་མའི་ལྷག་མ་ལས་པའི་ཕྱིར་རོ།
en: A bodhisattva’s body is not pervasive to the same extent, the reason being that it is affected by residual stains.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཚེས་གཉིས་ཀྱི་ཟླ་བ་ནི་ཟླ་བ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་བ་ནས།
en: “Consider, noble son, the analogy of the crescent moon during the bright fortnight.

source: ཟླ་བ་ཉ་བའི་བར་གྱི་ཟླ་བ་ཡང་ཟླ་བ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་
en: It is called the moon, just as much as the full moon is.

source: མོད་ཀྱི། ཚེས་གཉིས་ཀྱི་ཟླ་བ་ཅི་འདྲ་བ་དེ་ལྟ་བུར་ཟླ་བ་ཉ་བ་མ་ཡིན་ནོ།
en: Still, the full moon is different from the crescent moon.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་ཉིད་ཐོབ་པའི་ཕྱིར་ཏེ།
en: And why? Because it has reached its intrinsic nature.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུར་བཅས་ཏེ་ལུས་ཀྱི་གྲངས་སུ་འགྲོ་
en: Noble son, similarly, the bodhisattva’s body is called a body, just as the thus-gone ones’ body is called a body.

source: མོད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུའི་དྲུང་ན་ལམ་མེར་མི་འགྱུར། ལྷན་ནེར་མི་འགྱུར། ལྷང་ངེར་མི་འགྱུར་རོ།
en: However, when compared to the body of a thus-gone one, a bodhisattva’s body is not as bright, clear, and resplendent.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཟླ་བ་ཉ་བའི་དྲུང་ན་ཚེས་གཉིས་ཀྱི་ཟླ་བ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱང་ལུས་སུ་བརྗོད་པའི་མཚན་ཉིད་ཀྱིས་མཚན་ཉིད་གཅིག་མོད་ཀྱི། ཡོན་ཏན་གྱི་མཐུའི་མཚན་ཉིད་ཀྱིས་ནི་མ་ཡིན་ནོ།
en: Noble son, just as when comparing the full moon and the crescent moon, the bodies of the thus-gone ones and the bodhisattvas are the same as both fulfill the definition of a body, but they are not the same with respect to the power of their qualities.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ལུས་རྡོ་རྗེ་ལྟར་སྲ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities possess a body that is solid like vajra.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དག་གིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: What are those ten? They are being impervious to desire, anger, and dullness;

source: ཁྲོ་བ་དང་། གནོད་སེམས་ཀྱི་ཐ་བ་དང་། དྲི་མ་དང་། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་དང་། ལྟ་བ་ཕྱིན་ཅི་ལོག་དག་གིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: being impervious to fury, aggressive ill will, stains, pride, arrogance, conceit, and mistaken views;

source: འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་པོ་དེ་དག་གིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: being impervious to the eight worldly concerns;

source: ངན་སོང་གི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: being impervious to the suffering of the lower realms;

source: སེམས་ཅན་གྱི་སྡུག་བསྔལ་དག་གིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: being impervious to the suffering of sentient beings;

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བའི་སྡུག་བསྔལ་དག་གིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: being impervious to the suffering of birth, old age, sickness, and death;

source: མུ་སྟེགས་ཅན་དང་ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: being impervious to all attacks from non-Buddhists and other opponents;

source: བདུད་ཐམས་ཅད་དང་བདུད་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: being impervious to all demons and demonic gods;

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པ་རྣམས་ཡིན།
en: being impervious to all hearers and solitary buddhas;

source: འདོད་པ་ལ་སྤྱོད་པ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པ་རྣམས་ཡིན་ཏེ།
en: and being impervious to all those who pursue pleasure.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ལུས་རྡོ་རྗེ་ལྟར་སྲ་བ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess these ten qualities have a body that is solid like vajra.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་རྣམས་ཡིན་ཏེ།
en: “Noble son, bodhisattvas who possess ten qualities are great caravan leaders.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བཀུར་བ་རྣམས་ཡིན། མཆོད་པར་འོས་པ་རྣམས་ཡིན། ཕྱིན་པར་བྱེད་པ་རྣམས་ཡིན། བརྟན་པར་བྱ་བ་རྣམས་ཡིན། ཉེ་བར་འཚོ་བར་བྱ་བ་རྣམས་ཡིན། རྒྱགས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཚོགས་ཤིན་ཏུ་བསགས་པ་རྣམས་ཡིན། མི་ངོམས་པ་རྣམས་ཡིན། ཐོག་མར་འགྲོ་བ་རྣམས་ཡིན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པར་བྱ་བ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are venerability, being worthy of offerings, making others journey along, reliability, providing sustenance, providing perfect provisions, possessing vast accumulations, insatiability, heading the gathering, and skill in reaching the city of omniscience.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བཀུར་བ་ཡིན་པ་ནས་ཇི་ལྟར་ན་ཐམས་ཅད་མཁྱེན་པའི་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པར་བྱ་བ་ལ་མཁས་པའི་བར་དུ་ཡིན་ཞེ་ན།
en: “You may wonder, noble son, what these qualities may imply, from the bodhisattvas’ venerability through to their skill in reaching the city of omniscience.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ནི་རྒྱལ་པོ་དང་། རྒྱལ་པོ་ཆེན་པོའི་བློན་པོ་དག་གིས་བཀུར་བ་ཡིན་ནོ།
en: “Noble son, great caravan leaders are venerated by everyone, including kings and royal ministers.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ཡང་སངས་རྒྱས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཉན་ཐོས་རྣམས་ཀྱིས་བཀུར་བ་ཡིན་ནོ།
en: Similarly, as great caravan leaders, bodhisattvas are venerated by buddhas and hearers of the buddhas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། དེད་དཔོན་ཆེན་པོ་ནི་བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། གྲོང་བ་དང་། ཡུལ་གྱི་མི་རྣམས་ཀྱིས་མཆོད་པར་འོས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, great caravan leaders are worthy of the offerings of brahmins, nobility, townspeople, and country dwellers.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ཡང་སློབ་པ་དང་། མི་སློབ་པ་དང་། གཞན་ཡང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དག་གིས་མཆོད་པར་འོས་པ་ཡིན་ནོ།
en: Similarly, as great caravan leaders bodhisattvas are worthy of the offerings of those who train and those who are beyond training, just as they are worthy of the offerings of gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ནི་འབྲོག་དགོན་པར་ལམ་གྲོགས་ཀྱི་ཚོགས་འཆན་པས་གཙེས་པ་དག་ལེགས་པར་བདེ་ཞིང་ཡོངས་སུ་མི་སྐྱོ་བར་ཕྱིན་པར་བྱེད་པ་ཡིན་ཏེ།
en: “Noble son, when passing through a wilderness great caravan leaders will make their companions, who are tormented by roaming, journey along happily and free of weariness.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ཡང་འཁོར་བའི་འབྲོག་དགོན་པ་ཆེན་པོའི་ནང་ན་སེམས་ཅན་ལམ་གྲོགས་ཀྱི་ཚོགས་ཉོན་མོངས་པའི་འཆན་པས་གཙེས་པ་དག་ལེགས་པར་བདེ་ཞིང་ཡོངས་སུ་མི་སྐྱོ་བར་ཕྱིན་པར་བྱེད་པ་ཡིན་ནོ།
en: Similarly, within the wilderness of cyclic existence bodhisattvas will, as great caravan leaders, make sentient beings who are tormented by roaming through the afflictions journey along happily and free from weariness.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ལ་བརྟེན་ན། སྡུག་བསྔལ་བ་དང་། ཕོངས་པ་དག་འབྲོག་དགོན་པ་ནས་འབྱུང་བར་འགྱུར་རོ།
en: “Noble son, by relying on a great leader those who suffer and are destitute will escape the wilderness.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ལ་བརྟེན་ན་མུ་སྟེགས་ཅན་གཞན་སྤྱོད་པ་ཅན་དང་། ཀུན་ཏུ་རྒྱུ་དང་། གཅེར་བུ་བ་རྣམས་འཁོར་བའི་འབྲོག་དགོན་པ་ཆེན་པོ་ནས་འབྱུང་བར་འགྱུར་རོ།
en: Likewise, the carakas, the parivrājakas, the nirgranthas, and other such non-Buddhists will escape the great wilderness of cyclic existence by relying on great bodhisattva leaders.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ནི་རྒྱལ་པོ་དང་། ལས་བྱེད་པའི་མི་དང་། ཞོ་ཤས་འཚོ་བ་དང་། དེ་མ་ཡིན་པའི་སེམས་ཅན་གཞན་རྣམས་ཉེ་བར་འཚོ་བ་ཡིན་ཏེ།
en: “Noble son, great caravan leaders will provide sustenance for nobility, officials, day-laborers, and all other people.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་དེད་དཔོན་ཆེན་པོ་ཡང་འཁོར་བ་ལ་མངོན་པར་དགའ་བའི་སེམས་ཅན་རྣམས་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: Great bodhisattva leaders will, similarly, provide sustenance for the sentient beings who are fond of cyclic existence.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ནི་ནམ་ཕྱོགས་སུ་འགྲོ་བར་ཆས་ཏེ་ལམ་གྲོགས་མང་པོ་དང་ལྷན་ཅིག་ཏུ་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པར་བྱ་བའི་ཕྱིར་འབྲོག་དགོན་པར་ཞུགས་པ་དེའི་ཚེ།
en: “Noble son, when a great leader is on a journey to a city together with many fellow travelers,

source: གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་གྱི་བར་དུ་རྒྱགས་ཕུན་སུམ་ཚོགས་པས་འབྲོག་དགོན་པ་དེ་ནས་ལེགས་པར་བདེ་ཞིང་ཡོངས་སུ་སྐྱོ་བ་མེད་པར་འབྱུང་བར་བྱེད་དོ།
en: he or she will keep supplying perfect provisions for as long as the party is on the road, and so all will be happy and free from weariness while journeying across the wilderness.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ཡང་ནམ་སངས་རྒྱས་ཀྱིས་བསྟེན་པའི་ཕྱོགས་སུ་འགྲོ་བར་འདོད་ཅིང་སེམས་ཅན་ལམ་གྲོགས་མང་པོ་དང་
en: Likewise, wishing to take the path followed by the buddhas in the company of numerous sentient beings, great bodhisattva leaders

source: དེ་འཁོར་བའི་འབྲོག་དགོན་པ་ཆེན་པོར་འཇུག་པར་འདོད་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པར་བྱ་བར་འདོད་པ་
en: wish to enter the great wilderness of cyclic existence. Thus, as they seek to lead everyone into the city of omniscience,

source: དེའི་ཚེ་བསོད་ནམས་ཀྱི་རྒྱགས་ཀྱི་ཚོགས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པས་འགྲོའོ།
en: they will keep providing perfect provisions of merit.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ནི་འཚོ་བའི་ཡོ་བྱད་འདི་ལྟ་སྟེ། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་ལ་སོགས་པ་མང་པོ་བསགས་ཤིང་ཕྱོགས་སུ་འགྲོའོ།
en: “Noble son, when great caravan leaders travel they will bring with them abundant means of livelihood in the form of gold, precious stones, pearls, beryl, conchs, crystals, coral, and so on.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ཡང་ནམ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་མངོན་པར་ཞུགས་པ་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཚོགས་ཤིན་ཏུ་བསགས་ཤིང་འགྲོའོ།
en: Similarly, when great bodhisattva leaders enter the city of omniscience they do so by means of an extremely vast accumulation of buddha qualities.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ནི་ནོར་བསགས་པས་ཆོག་མི་ཤེས་པ་ཡིན་ནོ།
en: “Noble son, great caravan leaders can never gather enough wealth.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ཡང་ཆོས་ཀྱི་ནོར་བསགས་པས་ཆོག་མི་ཤེས་པ་ཡིན་ནོ།
en: Great bodhisattva leaders, similarly, can never gather enough of the wealth of Dharma.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ནི་འདི་ལྟ་སྟེ། ནོར་ཕུན་སུམ་ཚོགས་པ་དང་། གཙོ་བོ་དང་། དབང་ཡོད་པ་དང་། ངག་མཉན་པས་ལམ་གྲོགས་ཀྱི་ཚོགས་ཐམས་ཅད་ཀྱི་ཐོག་མར་འགྲོ་བ་ཡིན་ནོ།
en: “Noble son, because of their great wealth, preeminence, power, and eloquence, great caravan leaders will be at the head of the group of people with whom they travel.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ཡང་འདི་ལྟ་སྟེ། ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་དང་། ཡོངས་ཀྱི་གཙོ་བོ་དང་། ཆོས་ལ་དབང་བ་དང་། མ་ལོག་པར་སྨྲ་བས་སེམས་ཅན་ལམ་གྲོགས་ཀྱི་ཚོགས་ཐམས་ཅད་ཀྱི་ཐོག་མར་འགྲོ་བ་ཡིན་ནོ།
en: Likewise, because of their excellent qualities, utter preeminence, mastery of the Dharma, and unerring speech, great bodhisattva leaders will be heading the gathering of the beings with whom they travel.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་དེད་དཔོན་ཆེན་པོ་ནི་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པར་བྱ་བ་ལ་མཁས་པ་ཡིན་ནོ།
en: “Noble son, great caravan leaders are experts on the way to reach a city.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པར་བྱ་བ་ལ་མཁས་པ་ཡིན་ཏེ།
en: Similarly, great bodhisattva leaders are experts on the way to reach the city of omniscience.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བཀུར་བ་ཡིན་པས་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པར་བྱ་བ་ལ་མཁས་པའི་བར་དུ་ཡིན་ནོ།
en: “Noble son, from venerability through to their leading into the city of liberation, this is how bodhisattvas are.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་ཆེན་པོ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas possessing these ten qualities are great caravan leaders.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ལམ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are expert in the path.
